#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AroCluster/arro-testtera/runs/run-pVMCmfakGSpnin4C

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Refreshing...
data.azurerm_resource_group.resource_group: Refreshing...
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03Yjk2ZGVhZS1jNzJkLTRhNGUtYjcxOC01ZmI3Njc4M2UwOGM7b2JqZWN0SWQ9M2JkNTVmMGEtN2ZjNi00ODgyLTg1ZTktYjc3ZGExMmE4MjJhO3N1YnNjcmlwdGlvbklkPWNlYzRjNTBkLTc5MjEtNGIzNi05MTA5LTVkZjQ1MjhkNjlkODt0ZW5hbnRJZD0zOTczNzE2NS1iNjM3LTQ1MWYtOGI2Ni1hMDZlMGFjNzY1ZjI=]
data.azurerm_resource_group.resource_group: Refresh complete after 0s [id=/subscriptions/cec4c50d-7921-4b36-9109-5df4528d69d8/resourceGroups/aro-openshit-dev-001-RG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.aro_cluster will be created
  + resource "azapi_resource" "aro_cluster" {
      + body                      = (sensitive value)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "aro-openshit-dev-001Aro"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cec4c50d-7921-4b36-9109-5df4528d69d8/resourceGroups/aro-openshit-dev-001-RG"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = {
          + "AppName"     = "ARO DEV PLATFORM"
          + "createdWith" = "Terraform"
          + "date"        = "01/02/2024"
          + "department"  = "Ops"
          + "environment" = "Development"
          + "owner"       = "AChauhan1@galaxe.com"
        }
      + type                      = "Microsoft.RedHatOpenShift/openShiftClusters@2023-04-01"
    }

  # azurerm_role_assignment.aro_cluster_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_cluster_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aro_resource_provider_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_resource_provider_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_subnet.master_subnet will be created
  + resource "azurerm_subnet" "master_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "master-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "aro-openshit-dev-001-RG"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "aro-openshit-dev-001VNet"
    }

  # azurerm_subnet.worker_subnet will be created
  + resource "azurerm_subnet" "worker_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "worker-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "aro-openshit-dev-001-RG"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "aro-openshit-dev-001VNet"
    }

  # azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.0.0.0/22",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "aro-openshit-dev-001VNet"
      + resource_group_name = "aro-openshit-dev-001-RG"
      + subnet              = (known after apply)
      + tags                = {
          + "AppName"     = "ARO DEV PLATFORM"
          + "createdWith" = "Terraform"
          + "date"        = "01/02/2024"
          + "department"  = "Ops"
          + "environment" = "Development"
          + "owner"       = "AChauhan1@galaxe.com"
        }
    }

  # random_string.resource_prefix will be created
  + resource "random_string" "resource_prefix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @GitAshuChauhan, Action: `pull_request`*